<!-- dflook/terraform-github-actions {"workspace":"staging","backend_type":"s3","label":"staging","backend":"831cce01f3cfe5d76dc09dde63297c54c3a5ce66d2842f68f494f41bdd4e30da","plan_job_ref":"Job plan #5 at https://github.com/GSA/usnotify-ssb/actions/runs/4116485091","plan_hash":"fea3669557b088987b95baa9c62a1c9d55d772958d4925644f081cd4fab1a3de","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 12 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_user_policy_attachment.sms_broker_policies["sms_broker"] will be created
  + resource "aws_iam_user_policy_attachment" "sms_broker_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "ssb-sms-broker"
    }

  # module.broker_sms.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = true
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-sms"
      + path                       = "./app-ssb-sms.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "wMWGB0dXHt21UE0Rli/uHopTmhN8QnrKCs7ZLlabvpQ="
      + space                      = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_sms.cloudfoundry_route.ssb_uri will be created
  + resource "cloudfoundry_route" "ssb_uri" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "ssb-sms-notify-management-staging"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management-staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-management-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-sandbox"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-sandbox"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "420bb231-f99f-4dea-8cda-d342981d2718"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "9745decb-4988-4bab-88a4-e3f07b36241c"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_sms.cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id                             = (known after apply)
      + name                           = "ssb-sms-db"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "88663dbc-92c9-4b40-9f07-fb4788436fc5"
      + space                          = "d835086a-1ce4-4b9e-bb0f-6b01a560b24a"
      + tags                           = [
          + "mysql",
        ]

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + update = "30m"
        }
    }

  # module.broker_sms.random_password.client_password will be created
  + resource "random_password" "client_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.broker_sms.random_uuid.client_username will be created
  + resource "random_uuid" "client_username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.sms_broker_policy.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "SMS broker policy (covers SNS, IAM)"
      + id          = (known after apply)
      + name        = "sms_broker"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sns:GetSMSAttributes",
                          + "sns:SetSMSAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "iam:CreateUser",
                          + "iam:DeleteUser",
                          + "iam:GetUser",
                          + "iam:CreateAccessKey",
                          + "iam:DeleteAccessKey",
                          + "iam:CreateRole",
                          + "iam:DeleteRole",
                          + "iam:GetRole",
                          + "iam:GetRolePolicy",
                          + "iam:PutRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:GetUserPolicy",
                          + "iam:PutUserPolicy",
                          + "iam:DeleteUserPolicy",
                          + "iam:CreatePolicy",
                          + "iam:DeletePolicy",
                          + "iam:GetPolicy",
                          + "iam:AttachUserPolicy",
                          + "iam:DetachUserPolicy",
                          + "iam:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.ssb-sms-broker-user.aws_iam_access_key.this_no_pgp[0] will be created
  + resource "aws_iam_access_key" "this_no_pgp" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "ssb-sms-broker"
    }

  # module.ssb-sms-broker-user.aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "ssb-sms-broker"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [apply #6](https://github.com/GSA/usnotify-ssb/actions/runs/4177905191)